Repository: youzarsiph/wagtail-tw-blocks
Catalog: wagtail_blocks/locale/*/LC_MESSAGES/django.po
Languages: ar, fr, tr

source: Plus
ar: إضافة
tr: Artı

source: Arrow
ar: سهم
fr: Flèche
tr: Ok

source: Soft
ar: ناعم
fr: Doux
tr: Yumuşak

source: Outline
ar: محيط
fr: Contour
tr: Kontur

source: Dash
ar: شرطة
fr: Tiret
tr: Tire

source: Info
ar: معلومة
tr: Bilgi

source: Success
ar: نجاح
fr: Succès
tr: Başarı

source: Warning
ar: تحذير
fr: Avertissement
tr: Uyarı

source: Error
ar: خطأ
fr: Erreur
tr: Hata

source: Primary
ar: أساسي
fr: Principal
tr: Birincil

source: Secondary
ar: ثانوي
fr: Secondaire
tr: İkincil

source: Accent
ar: تأكيد
tr: Vurgu

source: Border
ar: حد
fr: Bordure
tr: Kenarlık

source: Box
ar: صندوق
fr: Boîte
tr: Kutu

source: Lift
ar: رفع
fr: Relief
tr: Yükselt

source: Auto
ar: تلقائي
tr: Otomatik

source: Plain text
ar: نص عادي
fr: Texte brut
tr: Düz metin

source: Image
ar: صورة
tr: Resim

source: Image caption
ar: تعليق الصورة
fr: Légende de l’image
tr: Resim başlığı

source: Image attribution
ar: إسناد الصورة
fr: Crédit de l’image
tr: Resim atfı

source: Icon name (lucide icons)
ar: اسم الأيقونة (أيقونات Lucide)
fr: Nom de l’icône (icônes Lucide)
tr: Simge adı (Lucide ikonları)

source: Action label
ar: تسمية الإجراء
fr: Libellé d’action
tr: Eylem etiketi

source: Action internal link
ar: رابط داخلي للإجراء
fr: Lien interne de l’action
tr: Eylem iç bağlantısı

source: Action external link
ar: رابط خارجي للإجراء
fr: Lien externe de l’action
tr: Eylem dış bağlantısı

source: Action button color
ar: لون زر الإجراء
fr: Couleur du bouton d’action
tr: Eylem düğmesi rengi

source: Whether to show or hide item content
ar: تحديد ما إذا كان سيتم إظهار محتوى العنصر أو إخفاؤه
fr: Indique s’il faut afficher ou masquer le contenu de l’élément
tr: Öğe içeriğinin gösterilip gösterilmeyeceğini belirtir

source: Item title
ar: عنوان العنصر
fr: Titre de l’élément
tr: Öğe başlığı

source: Item content
ar: محتوى العنصر
fr: Contenu de l’élément
tr: Öğe içeriği

source: Accordion name
ar: اسم الأكورديون
fr: Nom de l’accordéon
tr: Akordeon adı

source: Accordion style
ar: نمط الأكورديون
fr: Style de l’accordéon
tr: Akordeon stili

source: Designates if tab is selected
ar: يُحدّد ما إذا كانت علامة التبويب محددة
fr: Indique si l’onglet est sélectionné
tr: Sekmenin seçili olup olmadığını belirtir

source: Designates if accordion is joined
ar: يُحدِّد ما إذا كان الأكورديون منضمًا
fr: Indique si l’accordéon est fusionné
tr: Akordeonun birleştirilmiş olup olmadığını belirtir

source: Accordion items
ar: عناصر الأكورديون
fr: Éléments de l’accordéon
tr: Akordeon öğeleri

source: Designates if alert is vertical or horizontal (default)
ar: يُحدّد ما إذا كان التنبيه عموديًا أم أفقيًا (الإعداد الافتراضي)
fr: Indique si l’alerte est verticale ou horizontale (par défaut)
tr: Uyarının dikey mi yatay mı olduğunu belirtir (varsayılan)

source: Alert style
ar: نمط التنبيه
fr: Style de l’alerte
tr: Uyarı stili

source: Alert level
ar: مستوى التنبيه
fr: Niveau d’alerte
tr: Uyarı düzeyi

source: Alert message
ar: رسالة التنبيه
fr: Message d’alerte
tr: Uyarı mesajı

source: Alert actions
ar: إجراءات التنبيه
fr: Actions de l’alerte
tr: Uyarı eylemleri

source: Video
ar: فيديو
fr: Vidéo

source: Caption
ar: تعليق
fr: Légende
tr: Altyazı

source: Designates if carousel is vertical or horizontal (default)
ar: يُحدّد ما إذا كان عرض الشرائح عموديًا أم أفقيًا (الإعداد الافتراضي)
fr: Indique si le carrousel est vertical ou horizontal (par défaut)
tr: Karusel'in dikey mi yatay mı olduğunu belirtir (varsayılan)

source: Carousel items
ar: عناصر عرض الشرائح
fr: Éléments du carrousel
tr: Karusel öğeleri

source: Whether to show or hide camera
ar: تحديد إظهار أو إخفاء الكاميرا
fr: Indique s’il faut afficher ou masquer l’appareil photo
tr: Kameranın gösterilip gösterilmeyeceğini belirtir

source: Whether to show or hide the header
ar: تحديد إظهار أو إخفاء الكاميرا
fr: Indique s’il faut afficher ou masquer l’en-tête
tr: Başlığın gösterilip gösterilmeyeceğini belirtir

source: Whether to show or hide which programming language is used
ar: تحديد إظهار أو إخفاء لغة البرمجة المستخدمة
fr: Indique s’il faut afficher ou masquer la langue de programmation utilisée
tr: Kullanılan programlama dilinin gösterilip gösterilmeyeceğini belirtir

source: Whether to show or hide copy buttons
ar: تحديد إظهار أو إخفاء أزرار النسخ
fr: Indique s’il faut afficher ou masquer les boutons de copie
tr: Kopyalama düğmelerinin gösterilip gösterilmeyeceğini belirtir

source: Whether to show or hide window buttons
ar: تحديد إظهار أو إخفاء أزرار النافذة
fr: Indique s’il faut afficher ou masquer les boutons de fenêtre
tr: Pencere düğmelerinin gösterilip gösterilmeyeceğini belirtir

source: File name
ar: اسم الملف
fr: Nom de fichier
tr: Dosya adı

source: Programming language
ar: لغة البرمجة
fr: Langage de programmation
tr: Programlama dili

source: Code content
ar: محتوى الكود
fr: Contenu du code
tr: Kod içeriği

source: Diff Item 1
ar: عنصر الفرق 1
fr: Élément diff 1
tr: Fark öğesi 1

source: Diff Item 2
ar: عنصر الفرق 2
fr: Élément diff 2
tr: Fark öğesi 2

source: Designates if FAB is vertical or flower shaped (quarter circle)
ar: يُحدّد ما إذا كان الزر العائم عموديًا أم على شكل زهرة (ربع دائرة)
fr: Indique si le FAB est vertical ou en forme de fleur (quart de cercle)
tr: FAB'ın dikey mi yoksa çeyrek daire (çiçek) biçimli mi olduğunu belirtir

source: FAB toggle btn
ar: زر تبديل الزر العائم
fr: Bouton de bascule du FAB
tr: FAB değiştir düğmesi

source: FAB main action
ar: الإجراء الرئيسي للزر العائم
fr: Action principale du FAB
tr: FAB ana eylemi

source: FAB items
ar: عناصر الزر العائم
fr: Éléments du FAB
tr: FAB öğeleri

source: Gallery items
ar: عناصر المعرض
fr: Éléments de la galerie
tr: Galeri öğeleri

source: Item date
ar: تاريخ العنصر
fr: Date de l’élément
tr: Öğe tarihi

source: Designates if timeline is compact
ar: يُحدّد ما إذا كان المخطط الزمني مضغوطًا
fr: Indique si la chronologie est compacte
tr: Zaman çizelgesinin sıkıştırılmış olup olmadığını belirtir

source: Designates if timeline is vertical or horizontal (default)
ar: يُحدّد ما إذا كان المخطط الزمني عموديًا أم أفقيًا (الإعداد الافتراضي)
fr: Indique si la chronologie est verticale ou horizontale (par défaut)
tr: Zaman çizelgesinin dikey mi yatay mı olduğunu belirtir (varsayılan)

source: Designates if dates should snap to icons
ar: يُحدّد ما إذا كان يجب محاذاة التواريخ مع الأيقونات
fr: Indique si les dates doivent s’aligner sur les icônes
tr: Tarihlerin simgelere hizalanıp hizalanmayacağını belirtir

source: Timeline items
ar: عناصر المخطط الزمني
fr: Éléments de la chronologie
tr: Zaman çizelgesi öğeleri

source: Item name
ar: اسم العنصر
fr: Nom de l’élément
tr: Öğe adı

source: Item color
ar: لون العنصر
fr: Couleur de l’élément
tr: Öğe rengi

source: Designates if Steps is vertical or horizontal (default)
ar: يُحدّد ما إذا كانت الخطوات عمودية أم أفقية (الإعداد الافتراضي)
fr: Indique si les étapes sont verticales ou horizontales (par défaut)
tr: Adımların dikey mi yatay mı olduğunu belirtir (varsayılan)

source: Steps items
ar: عناصر الخطوات
fr: Éléments des étapes
tr: Adım öğeleri

source: Alert
ar: تنبيه
fr: Alerte
tr: Uyarı

source: Code
ar: كود
tr: Kod

source: Rich text
ar: نص منسّق
fr: Texte enrichi
tr: Zengin metin

source: Tab Content
ar: محتوى علامة التبويب
fr: Contenu de l’onglet
tr: Sekme içeriği

source: Tab name
ar: اسم علامة التبويب
fr: Nom de l’onglet
tr: Sekme adı

source: Designates if tab buttons position is reversed
ar: يُحدّد ما إذا كان موضع أزرار التبويبات معكوسًا
fr: Indique si la position des boutons d’onglet est inversée
tr: Sekme düğmelerinin konumunun ters olup olmadığını belirtir

source: Tab style
ar: نمط التبويب
fr: Style de l’onglet
tr: Sekme stili

source: Tab items
ar: عناصر التبويب
fr: Éléments de l’onglet
tr: Sekme öğeleri

source: Toast items
ar: عناصر الإشعار المنبثق
fr: Éléments de notification toast
tr: Toast öğeleri

source: Item image
ar: صورة العنصر
fr: Image de l’élément
tr: Öğe resmi

source: Item description
ar: وصف العنصر
fr: Description de l’élément
tr: Öğe açıklaması

source: Item internal link
ar: رابط داخلي للعنصر
fr: Lien interne de l’élément
tr: Öğenin iç bağlantısı

source: Item external link
ar: رابط خارجي للعنصر
fr: Lien externe de l’élément
tr: Öğenin dış bağlantısı

source: Actions
ar: إجراءات
tr: Eylemler

source: List title
ar: عنوان القائمة
fr: Titre de la liste
tr: Liste başlığı

source: List items
ar: عناصر القائمة
fr: Éléments de la liste
tr: Liste öğeleri

source: Phone wallpaper
ar: خلفية الهاتف
fr: Fond d’écran du téléphone
tr: Telefon duvar kağıdı

source: Whether to show or hide toolbar
ar: تحديد إظهار أو إخفاء شريط الأدوات
fr: Indique s’il faut afficher ou masquer la barre d’outils
tr: Araç çubuğunun gösterilip gösterilmeyeceğini belirtir

source: Browser URL
ar: عنوان المتصفح (URL)
fr: URL du navigateur
tr: Tarayıcı URL’si

source: Browser wallpaper
ar: خلفية المتصفح
fr: Fond d’écran du navigateur
tr: Tarayıcı duvar kağıdı

source: Window wallpaper
ar: خلفية النافذة
fr: Fond d’écran de la fenêtre
tr: Pencere duvar kağıdı

source: Swipe left
ar: اسحب لليسار
fr: Balayer vers la gauche
tr: Sola kaydır

source: Swipe right
ar: اسحب لليمين
fr: Balayer vers la droite
tr: Sağa kaydır

source: File name:
ar: اسم الملف:
fr: Nom de fichier :
tr: Dosya adı:

source: Copy
ar: نسخ
fr: Copier
tr: Kopyala

source: View
ar: عرض
fr: Voir
tr: Görüntüle
